/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-19
*
*	版本： 		V2.0
*
*	说明： 		WiFi实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

#include <ioCC2530.h>
#include "Usart.h"
#include "Rs485.h"
#include "delay.h"
#include "Lamp.h"
#include "Time.h"
#include "WiFi.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();     //初始化32M时钟
    LampInit();         //初始化底座灯 
    Rs485_Init();       //初始化485
    USRT0_Init();       //初始化串口0
    USRT1_Init();       //初始化串口1
    WiFi_Init();        //初始化WiFi模块    
    Init_Timer1();      //初始化定时器1(1ms)   

    while(1)
    {
        USART_Data_Send();  //串口数据发送
        USART1_IRQHand();   //串口1数据处理(485数据处理)
    }
}
