#include "delay.h"
#include "ADC.h"

unsigned int ADC_Data = 0;

//==========================================================
//	函数名称：	ADC_Init
//
//	函数功能：	ADC初始化函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void ADC_Init(void)
{
  P0SEL |= 0x04;      //P0_2端口设置为外设功能
  P0DIR &= ~0x04;     //P0_2端口设置为输入端口
  APCFG |= 0x04;      //P0_2作为模拟I/O使用
}

//==========================================================
//	函数名称：	Get_ADC_Value
//
//	函数功能：	读取ADC的数据
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void Get_ADC_Value(void)
{
  static uint8_t HL_Data[3];
  
  ADCIF = 0;
  //参考电压选择AVDD5引脚，512抽取率，AIN0通道2
  ADCCON3 = 0xB2;
  while(!ADCIF);      //等待A/D转换完成
  
  HL_Data[0] = ADCH;
  HL_Data[1] = ADCL;
  
  ADC_Data = ((HL_Data[0]*256)+HL_Data[1])/10; //读取ADC数据
}