#include "stm32f1xx.h"
#include "delay.h"
#include "usart.h"
#include "led.h"
#include "key.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-31
*
*	版本： 		V1.0
*
*	说明： 		串口通信实验-HAL库版本
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
	HAL_Init();           //初始化HAL库
	LED_Init();						//初始化LED
	KEY_Init();						//初始化按键
	UART2_Init(115200);		//初始化串口二

	while(1)
	{
		USART2_Data_Send();	//串口二数据发送(按下按键后发送)
		USART2_IRQHand();		//串口二数据反馈(反馈上位机数据)
	}
}





