#include "TM1640.h"	
#include "Rs485.h"
#include "timer.h"
#include "SHT20.h"
#include "usart.h"
#include "delay.h"
#include "WiFi.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-03-19
*
*	版本： 		V1.0
*
*	说明： 		STM32F767-WiFi模块实验
*
*	修改记录：
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
	HAL_Init();             	//初始化HAL库  
	Rs485_Init();							//初始化485
	SHT2x_Init();							//初始化温湿度
	TM1640_Init();						//初始化数码管
	UART1_Init(115200);				//初始化串口1
	TIM2_Init(1000-1,108-1);	//初始化定时器2(1ms)
	WiFi_Init();							//初始化WiFi

	while(1)
	{
		Display_Data();					//获取温湿度数据并显示到数码管
		USART_Data_Send();			//串口数据发送
	}
}



