/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-11
*
*	版本： 		V2.0
*
*	说明： 		光电传感器模块实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

#include <ioCC2530.h>
#include "Optocoupler.h"
#include "OLEDIIC.h"
#include "Usart.h"	
#include "delay.h"
#include "Rs485.h"
#include "OLED.h"
#include "Lamp.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();     //初始化32M时钟
    Optocoupler_Init();	//初始化光电传感器
    OLED_IIC_Init();    //初始化OLED  I2C
    OLED_Init();        //初始化OLED屏
    LampInit();         //初始化底座灯
    OLED_Init_UI();     //初始化显示界面

    while(1)
    {
        if(Optocoupler_State_Read())	//读取光电状态
        {
            OLED_P8x16Str(20,6,"OK  ");
        }
        else
        {
            OLED_P8x16Str(20,6,"NULL");
        }
    }
}
