/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-04-08
*
*	版本： 		V1.0
*
*	说明： 	        矩阵键盘模块程序
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

#include "Martix_Key.h"	
#include <ioCC2530.h>
#include "OLEDIIC.h"
#include "delay.h"
#include "Rs485.h"
#include "usart.h"
#include "OLED.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();     //初始化32M时钟
    KEY_Init();         //初始化按键
    Rs485_Init();       //初始化485
    USRT1_Init();       //初始化串口1
    OLED_IIC_Init();    //初始化OLED_IIC
    OLED_Init();        //初始化OLED 
    OLED_Init_UI();     //OLED显示

    while(1)
    {
        KEY_ConFig();  	//接收按键输入
        Key_Feedback();	//检测到按键后显示到OLED屏上并打印到串口中
    }
}
