#include "delay.h"
#include "EXTI.h"
#include "KEY.h"
#include "LED.h"

uint8_t Key_Flag = 1;

//==========================================================
//	函数名称：	EXTI_Init()
//
//	函数功能：	KEY初始化程序--外部中断方式
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void EXTI_Init(void)
{
  IEN2 |= 0x10;         //端口1中断使能
  P1IEN |= 0x20;        //端口P1_5外部中断使能
  PICTL |= 0x20;        //端口P1_5下降沿触发 
  EA = 1;               //使能总中断
}

//==========================================================
//	函数名称：	P1_ISR
//
//	函数功能：      中断处理函数 
//
//	入口参数：	无
//
//	返回参数：	0为抬起   1为按键按下
//
//	说明：		
//==========================================================
#pragma vector = P1INT_VECTOR    //格式：#pragma vector = 中断向量，紧接着是中断处理程序 
__interrupt void P1_ISR(void)
{
   if(Key_Flag)
   {
      Key_Flag = 0;
   }
   
   P1IFG &= ~ 0x20;        //软件清除P1_5引脚的标志位
   P1IF = 0;               //软件清除P1端口组的标志位
}
