#include "Stepper_Motor.h"
#include "stm32f1xx.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-11
*
*	版本： 		V2.0
*
*	说明： 		步进电机实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
  HAL_Init();             				//初始化HAL库 
	Rs485_Init();										//初始化485
	UART1_Init(115200);							//初始化串口一
	Stepper_Motor_Init();						//初始化步进电机

	while(1)
	{
		Stepper_Motor_Turn(1,20,100);		//最大支持40ms/圈
		delay_ms(500);
		Stepper_Motor_Turn(0,20,100);		//最大支持40ms/圈
		delay_ms(500);
	}
}







