/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-11
*
*	版本： 		V2.0
*
*	说明： 		HF-RFID实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/
#include <ioCC2530.h>
#include "OLEDIIC.h"
#include "delay.h"
#include "RC522.h"
#include "Usart.h"	
#include "Rs485.h"
#include "Time.h"
#include "OLED.h"
#include "Lamp.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();           //初始化32M时钟
    LampInit();               //底座灯初始化
    Rs485_Init();             //初始化485
    USRT1_Init();             //初始化串口1
    OLED_IIC_Init();          //初始化OLEDIIC
    OLED_Init();              //初始化OLED
    RC522_Init();             //初始化RFID
    OLED_Init_UI();           //初始化OLED界面
    Init_Timer1();            //初始化定时器1(20ms)

    while(1)
    {
       IC_Card_Search();      //读取卡信息
    }
}
