#include <ioCC2530.h>
static unsigned long TicksCounter;
//==========================================================
//	函数名称：	Init_Timer1()
//
//	函数功能：	定时器1初始化函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		定时器时钟16MHz，中断周期1000HZ
//==========================================================
void TIM1_Init(void)
{
  T1CC0L   = (unsigned char)(125&0xFF);        //设置最大计数值的低8位
  T1CC0H   = (unsigned char)((125>>8)&0xFF);        //设置最大计数值的高8位
  T1CCTL0 |= 0x04;        //开启通道0的输出比较模式
  T1IE     = 1;           //使能定时器1中断
  T1OVFIM  = 1;           //使能定时器1溢出中断
  EA       = 1;           //使能总中断
  T1CTL    = 0x0e;        //分频系数是128,模模式
}
//==========================================================
//	函数名称：	long GetTicks(void)
//
//	函数功能：	获取当前定时器Ticks
//
//	入口参数：	
//
//	返回参数：	无
//
//	说明：		
//==========================================================
unsigned long HAL_GetTick(void)
{
  return TicksCounter;
}
//==========================================================
//	函数名称：	void TIM_Delay(unsigned long time)
//
//	函数功能：	定时器延时
//
//	入口参数：	time:延时时间
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void HAL_Delay(unsigned long time)
{
	unsigned long NextTicks;
	NextTicks = HAL_GetTick() + time;
	while(HAL_GetTick() < NextTicks);
}
//==========================================================
//	函数名称：	Timer1_Sevice()
//
//	函数功能：	定时器1服务函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
#pragma vector = T1_VECTOR
__interrupt void Timer1_Sevice()
{
  T1STAT &= ~0x01;      //清除定时器1通道0中断标志
  TicksCounter++;
}