#include "Optocoupler.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"
#include "key.h"
#include "led.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-02-20
*
*	版本： 		V1.0
*
*	说明： 		STM32F767-光电对射传感器实验
*
*	修改记录：
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
	HAL_Init();       		//初始化HAL库   
	Rs485_Init();					//初始化485
	UART7_Init(115200);		//初始化串口七
	Optocoupler_Init();		//初始化光电传感器

	while(1)
	{
		if(Optocoupler_State_Read())	//读取光电传感器状态
		{
			Rs485_Send("OK\r\n",4);
		}
	}
}



