#include "stm32f1xx.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"
#include "SW420.h"
#include "main.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-11
*
*	版本： 		V2.0
*
*	说明： 		震动传感器数据采集与显示实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

uint8_t SW420_Sta[2];

int main(void)
{
  HAL_Init();             			//初始化HAL库 
	SW420_Init();		 							//初始化震动传感器
	Rs485_Init();									//初始化485
	UART1_Init(115200);						//初始化串口1

	while(1)
	{
		SW420_Fig();								//检测震动

		if(!DataHandling_485(Addr_Shock))		//处理485数据
		{
			SW420_Sta[0] = SW420_fig;
			Rs485_Send(Addr_Shock,Rx_Stack.Src_Adr,Shock_Count,1,SW420_Sta);	//发送数据到WiFi模块
		}
	}
}




