/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-18
*
*	版本： 		V2.0
*
*	说明： 		陀螺仪实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

#include <ioCC2530.h>
#include "OLEDIIC.h"
#include "mpu6050.h"
#include "Usart.h"
#include "Rs485.h"
#include "delay.h"
#include "Time.h"
#include "Lamp.h"
#include "OLED.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();         //初始化32M时钟
    LampInit();             //初始化底座灯
    Rs485_Init();           //初始化485
    USRT1_Init();           //初始化串口1
    OLED_IIC_Init();        //初始化OLEDIIC
    MPU_IIC_Init(); 	    //初始化MPU_IIC总线
    OLED_Init();            //初始化OLED  
    MPU_Init();             //初始化陀螺仪
    OLED_Init_UI();         //显示陀螺仪数据界面  

    while(1)
    {
      OLED_Main_UI();       //获取陀螺仪数据，并显示到OLED屏上
    }
}
