/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-18
*
*	版本： 		V2.0
*
*	说明： 		大气压力实验
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/
#include "Atmosphere.h"
#include <ioCC2530.h>
#include "OLEDIIC.h"
#include "Usart.h"
#include "Rs485.h"
#include "delay.h"
#include "Lamp.h"
#include "OLED.h"

//==========================================================
//	函数名称：	main()
//
//	函数功能：	程序入口函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void main(void)
{
    Hal_Init_32M();         //初始化32M时钟
    LampInit();             //初始化底座灯
    Rs485_Init();           //初始化485
    Atmosphere_Init();      //初始化大气压力传感器
    USRT1_Init();           //初始化串口1
    OLED_IIC_Init();        //初始化OLEDIIC
    OLED_Init();            //初始化OLED
    OLED_Init_UI();         //显示大气压力数据界面

    while(1)
    {
        Atmosphere_TestFunc();//获取传感器数据并显示到OLED屏上 除
    }
}
