#include "Atmosphere.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"
#include "key.h"
#include "led.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-03-11
*
*	版本： 		V1.0
*
*	说明： 		STM32F767-大气压力模块实验
*
*	修改记录：
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
	HAL_Init();       		//初始化HAL库
	LED_Init();						//初始化LED
	KEY_Init();						//初始化按键
	Rs485_Init();					//初始化485
	Atmosphere_Init();  	//初始化大气压力传感器
	UART7_Init(115200);		//初始化串口七

	while(1)
	{
			delay_ms(1000);
			Atmosphere_TestFunc();  //检测大气压力数据并输出到串口中
	}
}



